/*
 * Formatting Refrences:
 * name: XXX  //The name of the element
 * description: XXX[\n]XXX //The description of the element
 * child: [XXX,XXX] //The child of the element
 * PLEASE CHECK THE JSON FORMAT BEFORE SAVING THIS FILE!
 */
{
  "points": [
    {
      "name": "Main NAM Files",
      "description": "The Network Addon Mod will introduce numerous network and traffic enhancements to the game."
    },
    {
      "name": "Documentation",
      "description": "This will install the documentation for the Network Addon Mod."
    },
    {
      "name": "Run Cleanitol and the Station Updater",
      "description": "Run the Cleanitol program, which removes all plugins incompatible with the NAM from your system.\nThis is automatically done at a NAM upgrade, and usually doesn't have to be done otherwise."
    },
    {
      "name": "Traffic Driving Side (Usually shouldn't be changed)",
      "description": "The traffic driving side is usually set automatically, but can be changed here if necessary.",
      "child": [
        {
          "name": "Game traffic drives on right side of road",
          "description": "Choose this option only if your traffic drives on the right side of the road in the game."
        },
        {
          "name": "Game traffic drives on left side of road",
          "description": "Choose this option only if your traffic drives on the left side of the road in the game."
        }
      ]
    },
    {
      "name": "Traffic Simulator and Related Options",
      "description": "Includes options for the NAM Traffic Simulator, the Automata Controller, and the new Zones Data View.",
      "child": [
        {
          "name": "Select Traffic Simulator and Capacity Levels",
          "description": "Choose one of the Traffic Simulators here.\nCustom Traffic Simulators can be created with the Traffic Simulator Configuration Tool, which is optionally installed at the end of the main NAM installation.",
          "child": [
            {
              "name": "NAM Traffic Simulator Classic",
              "description": "Uses the standard Maxis capacities; useful for rural areas and towns."
            },
            {
              "name": "NAM Traffic Simulator Low",
              "description": "Increases capacities a little; useful for small to medium-sized cities."
            },
            {
              "name": "NAM Traffic Simulator Medium",
              "description": "Increases capacities a bit more; useful for medium to large-sized cities."
            },
            {
              "name": "NAM Traffic Simulator High",
              "description": "Increases capacities considerably; useful for large cities, or very large cities with little mass transit."
            },
            {
              "name": "NAM Traffic Simulator Ultra",
              "description": "Increases capacities a lot; useful for very large cities, especially with much regional traffic."
            },
            {
              "name": "Keep my previous traffic simulator",
              "description": "Retains the traffic simulator that is currently installed."
            },
            {
              "name": "Build a custom traffic simulator",
              "description": "Allows you to build a custom traffic simulator at the end of this installation."
            }
          ]
        },
        {
          "name": "New Zones Data View",
          "description": "Choose this option to add all networks and props to the standard Zones Data View.\nThe exact composition of this view can be refined by using the Traffic Simulator Configuration Tool."
        },
        {
          "name": "Autometa Controller Type",
          "description": "Choose one of the Automata Controllers here.\nCustom Automata Controllers can be created with external tools, such as Ilive's Reader.",
          "chind": [
            {
              "name": "Persitent Autometa",
              "description": "This option makes the display of all automata last longer.\nIt reduces the game speed slightly."
            },
            {
              "name": "Standard Automata Numbers",
              "description": "At a minimum, this option is required as it adds additional functionality."
            },
            {
              "name": "Standard Automata Numbers 24h",
              "description": "This option increases the overall display of automata so that they appear for most of the 24 hour Sim day.\nIt reduces the game speed slightly."
            },
            {
              "name": "Radical Automata Numbers",
              "description": "This option signifcantly adjusts the overall display of Automata so that they appear more.\nIt reduces the game speed slightly."
            },
            {
              "name": "Radical Automata Numbers 24h",
              "description": "This option signifcantly adjusts the overall display of Automata so that they appear more for most of the 24 hour Sim day.\nIt reduces the game speed moderately."
            }
          ]
        }
      ]
    },
    {
      "name": "NAM Networks and Network Expansion",
      "description": "Contains all the new NAM networks, as well as extensions to the existing Maxis networks.",
      "child": [
        {
          "name": "Bullet Train Mod (BTM)",
          "description": "Installs the Bullet Train Mod by Moonlight.\nThis mod completely replaces the standard monorail, and has many additional features.\nIt is based on the Japanese Shinkansen high-speed rail line.",
          "child": [
            {
              "name": "Main Bullet Train Mod",
              "description": "Installs the core files necessary for using the Bullet Train Mod."
            },
            {
              "name": "Ground Texture",
              "description": "Installs a special ground texture resembling a shadow underneath the Bullet Train Mod tracks."
            },
            {
              "name": "Alternate Concrete Texture",
              "description": "Replaces the Primary Concrete Texture with an almost-identical alternate one."
            },
            {
              "name": "Fence Prop",
              "description": "Adds a fence at ground level all around the route of the Bullet Train Mod."
            },
            {
              "name": "N700 Series Shinkansen Train",
              "description": "Replaces the standard monorail train with a detailed replica of the N700 Series Shinkansen train."
            }
          ]
        },
        {
          "name": "Canal Addon Mod (CAN-AM)",
          "description": "Allows you to choose either the SimGoober or Callagrafx version of the Canal Addon Mod.",
          "child": [
            {
              "name": "SimGoober's Canals",
              "description": "With this option you can build functional canals for SimGoober's canal system."
            },
            {
              "name": "Callagrafx' Canals",
              "description": "With this option you can build functional canals for Callagrafx' canal system."
            }
          ]
        },
        {
          "name": "Diagonal Streets",
          "description": "Use this option for installing Diagonal Streets."
        },
        {
          "name": "Double-Height Monorail / Bullet Train Mod",
          "description": "Use this option for creating double-height Monorail or Bullet Train (Shinkansen) networks."
        },
        {
          "name": "El Rail",
          "description": "Contains different variations and extensions of the El Rail network.",
          "child": [
            {
              "name": "El Rail Alternate Implementation",
              "description": "This is Moononght's implementation of the El Rail network.\nAlthough it is based on a Japanese El Rail network, it has more complex pieces than the standard El Rail, and fits in almost anywhere.",
              "child": [
                {
                  "name": "Core El Rail Network",
                  "description": "Installs the core files necessary for using Moonlinght's El Rail Alternate Implementation."
                },
                {
                  "name": "El Rail Catenaries",
                  "description": "Adds catenary props to the El Rail Alternate Implementation."
                },
                {
                  "name": "El Rail Fence Props",
                  "description": "Adds a fence at ground level all around the route of Moonlinght's El Rail Alternate Implementation."
                },
                {
                  "name": "El Rail Ground Texture",
                  "description": "Installs a special ground texture resembling a shadow underneath the El Rail tracks."
                },
                {
                  "name": "El Rail Cool Color Concrete Texture",
                  "description": "Replaces the standard Warm Color Concrete Texture with a slightly cooler-colored one."
                }
              ]
            },
            {
              "name": "El Rail over Avenue Networks",
              "description": "This option allows you to create El Rail over Avenue and El Rail over RD-4 networks."
            },
            {
              "name": "El Rail over Road Networks",
              "description": "This option allows you to create El Rail over Road and El Rail over Street networks."
            },
            {
              "name": "Double-Height Elevated Rail",
              "description": "This option contains puzzle pieces for creating double-height sections of your Elevated Rail networks."
            }
          ]
        },
        {
          "name": "Elevated Road Networks",
          "description": "Contains both the Draggable and Modular versions of the Elevated Road Networks, which consist of elevated versions of the Road, One-Way Road, and Avenue networks.\nThese two options are totally independent.",
          "child": [
            {
              "name": "Draggable Elevated Road Networks",
              "description": "Installs draggable, elevated versions of the Road, one-Way Road, and Avenue networks."
            },
            {
              "name": "Modular Elevated Road Networksm",
              "description": "Installs both overpasses and puzzle pieces for the elevated versions of the Road, one-Way Road, and Avenue networks."
            }
          ]
        },
        {
          "name": "Flexible Underpasses (FLUPs)",
          "description": "Use this option for creating Flexible Underpasses."
        },
        {
          "name": "Fractionally Angled Networks (FANs)",
          "description": "Enable Fractionally Angled Networks.\nCurrently, two angles are supported: 18.43бу and 26.57бу along with their complements, 71.57бу and 63.43бу.\nThe basic repeating patterns require 2x3 tiles and 2x2 tiles, respectively.",
          "child": [
            {
              "name": "Fractionally Angled Road Networks (FARs)",
              "description": "This option allows you to create Fractionally Angled Roads, One-Way Roads, and Avenues using puzzle pieces."
            },
            {
              "name": "Fractionally Angled Railroads (FARRs)",
              "description": "This option allows you to create Fractionally Angled Railroads using puzzle pieces."
            },
            {
              "name": "Draggable FAR",
              "description": "This option allows you to create Fractionally Angled Roads by dragging without having to use puzzle pieces."
            }
          ]
        },
        {
          "name": "Ground Light Rail / Tram",
          "description": "Choose options for Ground Light Rail / Tram functionality.",
          "child": [
            {
              "name": "Ground Light Rail",
              "description": "Use this option for creating Ground Light Rail networks.\nThese are differentiated from the Tram networks in that Ground Light Rail does not travel in or on streets, roads, or avenues."
            },
            {
              "name": "Tram in Avenue",
              "description": "Use this option for creating Tram in Avenue networks."
            },
            {
              "name": "Tram in Road",
              "description": "Use this option for creating Tram in Road and Tram on Road networks."
            },
            {
              "name": "Tram in Street",
              "description": "Use this option for creating Tram in Street networks."
            },
            {
              "name": "Extended Draggable Ground Light Rail",
              "description": "Use this option to enable two additional Tram styles with customizable base textures (requires rebuilding pillars on Elevated Rail)."
            }
          ]
        },
        {
          "name": "High Speed Rail Plugin",
          "description": "The High Speed Rail Project adds a new Monorail-based network extension to the game, with the look and feel of a High Speed Rail Project line.\nIt does not replace the current Monorail or Bullet Train network."
        },
        {
          "name": "Maxis Highway Override",
          "description": " Overrides the standard Maxis highway with a highway more compatible with the RHW.\nThe standard Maxis Highway interchanges are replaced and fractionally-angled Maxis highway (FAMHW) support is added."
        },
        {
          "name": "Network Widening Mod (NWM)",
          "description": "Choose options for Network Widening Mod functionality.\nThe Network Widening Mod contains roads, one-way roads, and avenues with more lanes, and/or center turning lanes for avenues, as well as other options.",
          "child": [
            {
              "name": "NWM Networks",
              "description": "The Network Widening Mod adds new network variations with variable widths to the game for Roads, One-Way Roads, and Avenues, built from starter pieces.",
              "child": [
                {
                  "name": "NWM TLA-3"
                },
                {
                  "name": "NWM AVE-2"
                },
                {
                  "name": "NWM ARD-3"
                },
                {
                  "name": "NWM OWR-1"
                },
                {
                  "name": "NWM OWR-3"
                },
                {
                  "name": "NWM NRD-4"
                },
                {
                  "name": "NWM TLA-5"
                },
                {
                  "name": "NWM OWR-4"
                },
                {
                  "name": "NWM OWR-5"
                },
                {
                  "name": "NWM RD-4"
                },
                {
                  "name": "NWM RD-6"
                },
                {
                  "name": "NWM Triple-Tile Networks"
                }
              ]
            },
            {
              "name": "Legacy Transition Piece Wealthification",
              "description": "Adds grass/sidewalk textures to Transition Puzzle Pieces.\nMAY NOT WORK WITH SOME GRAPHICS CARDS."
            }
          ]
        },
        {
          "name": "Ped Malls",
          "description": "Installs ped malls, which are tiles of various textures that permit pedestrian traffic in all directions, but no other type of traffic."
        },
        {
          "name": "Rail",
          "description": "Includes new types of rail networks.",
          "child": [
            {
              "name": "RealRailway (RRW)",
              "description": "Changes the look of the default heavy rail network to a more realistic look and adds functionality."
            },
            {
              "name": "Single Track Rail (STR)",
              "description": "Installs Single-Track Railroads."
            },
            {
              "name": "Underground Rail",
              "description": "Installs the Underground Rail network, which is an underground version of the standard heavy rail network."
            },
            {
              "name": "Viaduct Rail",
              "description": "Installs the Viaduct Rail network, which is an elevated version of the standard heavy rail network."
            }
          ]
        },
        {
          "name": "Real Highway Mod (RHW)",
          "description": "Includes the full Real Highway Mod, which is a completely different alternative to the standard Maxis highways, with almost innumerable types of customizations available.\nIt does not replace the Maxis highways.",
          "child": [
            {
              "name": "RHW L0 Networks",
              "child": [
                {
                  "name": "RHW L0 RHW-2"
                },
                {
                  "name": "RHW L0 RHW-3"
                },
                {
                  "name": "RHW L0 MIS"
                },
                {
                  "name": "RHW L0 RHW-4"
                },
                {
                  "name": "RHW L0 RHW-6S"
                },
                {
                  "name": "RHW L0 RHW-8S"
                },
                {
                  "name": "RHW L0 RHW-10S"
                },
                {
                  "name": "RHW L0 RHW-6C"
                },
                {
                  "name": "RHW L0 RHW-8C"
                }
              ]
            }
          ]
        }
      ]
    },
    {

    }
  ]
}
